<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="GENERATOR" content="Mozilla/4.5 [de] (WinNT; I) [Netscape]">
   <meta name="Author" content="Bernd Herd">
   <meta name="Description" content="Linux hat als Betriebssystem überzeugende Vorteile.">
   <meta name="KeyWords" content="linux,artikel">
   <title>Linux - das n&auml;chste Betriebssystem</title>
</head>
<body>

<h1>
Linux - das n&auml;chste Betriebssystem</h1>

<h2>
Einf&uuml;hrung</h2>
Wir schreiben das Jahr 1994. Die ganze EDV ist durch Bill Gates Windows
besetzt - die Ganze EDV? Nein, eine kleine Gruppe unbeugsamer Programmierer
widersetzt sich standhaft dem Monopol, mit Hilfe eines Zauberbetriebssystems
- Linux!
<p>Linux entspringt den gesammelten Anstrengungen von einigen zehntausend
Open Source programmierern, die nicht hingenommen haben, da&szlig; eine
so entscheidende Schl&uuml;sseltechnologie wie das Betriebssystem f&uuml;r
fast alle weltweit genutzten Computer in den H&auml;nden einer einzigen
Firma lag.
<h2>
Das Open Source Konzept</h2>
Linux steht <b>vollst&auml;ndig als Quellcode</b> zur Verf&uuml;gung. Dadurch
ist niemand mehr auf die Gnade einer einzelnen Firma angewiesen, was die
Richtung der Weiterentwicklung, Beheben von Fehlern und dem Support betrifft.
Die Lizenzen der Open Source Projekte sind so beschaffen, da&szlig; niemand
eine modifizierte Version eines Open Source Quellcodes verkaufen kann,
ohne auch den modifizierten Source wieder als Open Source Projekt zur Verf&uuml;gung
zu stellen.
<h2>
Konzeptionelle &Uuml;berlegenheit</h2>
Linux ist Windows sowohl konzeptionell als auch technisch in vielerlei
Hinsicht &uuml;berlegen:
<ul>
<li>
Das Open Source Konzept</li>

<ul>
<li>
vermeidet unbehebbare Probleme die man als Programmierer in Windows mit
einem Schulterzucken akzeptieren mu&szlig;te. Anstatt aufwendig einen Workaround
f&uuml;r ein Problem zu erarbeiten, wird stattdessen das Problem selbst
behoben, was oft viel einfacher ist.</li>

<li>
erlaubt es, anstelle von blindem Vertrauen in die "Sicherheit" von Windows
NT einen von Fachleuten &uuml;berpr&uuml;fbaren Quelltext zu stellen.</li>

<li>
Spart Kosten f&uuml;r Lizenzen</li>
</ul>

<li>
Das Unix / X-Windows Konzept und seine technische Realisierung in Linux</li>

<ul>
<li>
erlaubt eine wesentlich bessere Betreuung von Computern &uuml;ber Fernwartung
ohne Zugang zu Bildschirm und Tastatur</li>

<li>
erlaubt die Benutzung von nur einmal installierter Software durch viele
Terminals</li>

<li>
stellt durch das Benutzerkonzept eine besser gegen Fehlbedienung gesch&uuml;tzte
Umgebung zur Verf&uuml;gung als Windows</li>

<li>
stellt umfangreiche Kommunkationstechnologogien in Hybriden Netzen zur
Verf&uuml;gung. Linux kann Problemlos &uuml;ber das Netzwerk/Modem mit
Apple Macintosh / Windows 9x / Windows NT / Unix und Netware-Rechnern jeweils
in DEREN Sprache kommunizieren, ohne das zus&auml;tzliche kostenpflichtige
Software notwendig ist.</li>

<li>
betrachtet Programmierbarkein als eine selbstverst&auml;ndliche Systemfunktion
die ohne kostenpflichtige Zusatzprgramme auf jedem Rechner verf&uuml;gbar
ist.</li>

<li>
erlaubt die Protokollierung von Problemen usw.</li>
</ul>
</ul>

<h2>
Das Betriebssystem der Zukunft?</h2>
Wir bei Herd Software gehen davon aus, da&szlig; Linux in den n&auml;chsten
Jahren wesentlich an Bedeutung gewinnen wird. Daher arbeiten wir daran,
unseren Kunden langsam aber sicher die von uns entwickelten Technologien
auch f&uuml;r Linux zur Verf&uuml;gung zu stellen. Wir sind in erster Linie
bestrebt, die Ausf&uuml;hrung unserer Windows-Programme mit der <a href="wine.html">WINE</a>-Emulation
sicherzustellen, wollen aber soweit m&ouml;glich auch Linux-Programme und
Bibliotheken f&uuml;r Power PC entwickeln.
<p>Als ein erster Schritt in dieser Richtung haben wir unsere <i><a href="../../../../katalog/barvis.html">BarVision</a></i>
Strichcode-Technologie als Linux-Versionen bereitgestellt.
<h2>
Siehe Auch</h2>

<ul>
<li>
<a href="../../../../../../../../ti">Herd Software Technische Informationen</a></li>

<li>
<a href="index.html">Herd Software Linux Themen</a></li>
</ul>

</body>
</html>
